# ╔══════════════════════════════════════════════════════════════════╗
# ║  Brewfile  ·  Managed by dotfiles                              ║
# ║                                                                 ║
# ║  Install everything:  brew bundle --file=~/path/to/Brewfile     ║
# ║  Check status:        brew bundle check                         ║
# ╚══════════════════════════════════════════════════════════════════╝

# ─── Terminal & Shell ───────────────────────────────────────────
brew "starship"           # Cross-shell prompt
brew "tmux"               # Terminal multiplexer
brew "zoxide"             # Smart cd that learns your habits

# ─── Modern CLI Replacements ───────────────────────────────────
brew "eza"                # Modern ls with icons and git info
brew "bat"                # cat with syntax highlighting
brew "fd"                 # Fast find alternative
brew "ripgrep"            # Fast grep alternative
brew "fzf"                # Fuzzy finder
brew "git-delta"          # Syntax-highlighted git diffs
brew "tealdeer"           # Fast tldr pages client

# ─── Fonts ──────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ─── Terminal Emulators ─────────────────────────────────────────
cask "ghostty"            # Native, fast, modern terminal
cask "iterm2"             # Feature-rich macOS terminal
cask "alacritty"          # GPU-accelerated terminal

# ─── Apps (macOS) ──────────────────────────────────────────────
cask "xbar"               # Menu bar plugin manager
